C2CRIBuildDir/projects/C2C-RI/src/RIGUI/CustomTestSuites/NTCIPExtensionToBlankTestSuite/AppLayer/Data/tmp/TCS-C2CRI-NTCIP2306-WSME-1Sb-SHSP-SHConnect-EC.data

 
#<!--   
#       Title:  TCS-C2CRI-NTCIP2306-WSME-1Sb-SHSP-SHConnect-EC
#       Description:  TCS-C2CRI-NTCIP2306-WSME-1Sb-SHSP-SHConnect-EC
#       Related Procedure:  null
#       Version/Date: 2011/11/15 22:59:44
#-->

#ITERATION NAME = One
#GROUP NAME = General
#PARAMETER TYPE = String
#EDITABLE = true
#DOCUMENTATION = This variable represents the WSDL File to be verified.
WSDLFile = file:/c:/c2cri/testfiles/WSDLFiles/2306TstData1Sb0.wsdl

#PARAMETER TYPE = String
#EDITABLE = true
#DOCUMENTATION = The Subscription Service defined in the WSDL that will be used during the test.
SubscriptionServiceName = tmddOCSoapHttpService

#PARAMETER TYPE = String
#EDITABLE = true
#DOCUMENTATION = The Port defined in the WSDL that is related to the selected Subscription Service Name and will be used during the test.
SubscriptionPortName = tmddOCSoapHttpServicePort

#PARAMETER TYPE = String
#EDITABLE = true
#DOCUMENTATION = The Operation defined in the WSDL that is related to the selected Subscription Port Name and will be used during the test.
SubscriptionOperationName = OP_DeviceInformationSubscription

#PARAMETER TYPE = String
#EDITABLE = true
#DOCUMENTATION = The Publication Service defined in the WSDL that will be used during the test.
PublicationServiceName = tmddECSoapHttpService

#PARAMETER TYPE = String
#EDITABLE = true
#DOCUMENTATION = The Port defined in the WSDL that is related to the selected Publication Service Name and will be used during the test.
PublicationPortName = tmddECSoapHttpServicePort

#PARAMETER TYPE = String
#EDITABLE = true
#DOCUMENTATION = The Publication Operation defined in the WSDL that is related to the selected Service Name and will be used during the test.
PublicationOperationName = OP_DeviceInformationUpdate

#PARAMETER TYPE = String
#EDITABLE = true
#DOCUMENTATION = The Publication Message that will be used during the test.
PublicationMessage = <SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"><SOAP-ENV:Header/><SOAP-ENV:Body><c2c:c2cMessagePublication xmlns:c2c="http://www.ntcip.org/c2c-message-administration"><subscriptionID>string</subscriptionID><subscriptionCount>55</subscriptionCount></c2c:c2cMessagePublication><mes:dMSInventoryMsg xmlns:mes="http://www.tmdd.org/3/messages"><dms-inventory-item><restrictions><organization-information-forwarding-restrictions>4</organization-information-forwarding-restrictions></restrictions><device-inventory-header><organization-information><organization-id>string</organization-id><organization-name>string</organization-name><organization-location>stringstri</organization-location><organization-function>string</organization-function><organization-contact-details><contact-id>string</contact-id><person-name>string</person-name><person-title>string</person-title><phone-number>string</phone-number><phone-alternate>string</phone-alternate><mobile-phone-number>string</mobile-phone-number><mobile-phone-id>string</mobile-phone-id><fax-number>string</fax-number><pager-number>string</pager-number><pager-id>string</pager-id><email-address>string</email-address><radio-unit>string</radio-unit><address-line1>string</address-line1><address-line2>string</address-line2><city>string</city><state>st</state><zip-code>string</zip-code><country>string</country></organization-contact-details><center-contact-list><center-contact-details><center-id>string</center-id><center-name>string</center-name><center-location><latitude>3</latitude><longitude>3</longitude><horizontalDatum>3</horizontalDatum><height><altitude><kmDec>1000.00</kmDec></altitude><verticalDatum>1</verticalDatum></height></center-location><center-description>string</center-description><center-type>fixed</center-type><center-contact-details><contact-id>string</contact-id><person-name>string</person-name><person-title>string</person-title><phone-number>string</phone-number><phone-alternate>string</phone-alternate><mobile-phone-number>string</mobile-phone-number><mobile-phone-id>string</mobile-phone-id><fax-number>string</fax-number><pager-number>string</pager-number><pager-id>string</pager-id><email-address>string</email-address><radio-unit>string</radio-unit><address-line1>string</address-line1><address-line2>string</address-line2><city>string</city><state>st</state><zip-code>string</zip-code><country>string</country></center-contact-details></center-contact-details></center-contact-list><last-update-time><date>stringst</date><time>string</time><offset>strin</offset></last-update-time></organization-information><device-id>string</device-id><device-location><latitude>3</latitude><longitude>3</longitude><horizontalDatum>nad27</horizontalDatum><height><verticalLevel>2</verticalLevel></height></device-location><device-name>string</device-name><device-description>string</device-description><device-control-type>status only</device-control-type><controller-description>string</controller-description><network-id>string</network-id><node-id>string</node-id><node-name>string</node-name><link-id>string</link-id><link-name>string</link-name><link-direction>s</link-direction><linear-reference>string</linear-reference><linear-reference-version>6</linear-reference-version><route-designator>string</route-designator><device-url>string</device-url><last-update-time><date>stringst</date><time>string</time><offset>strin</offset></last-update-time></device-inventory-header><dms-sign-type>5</dms-sign-type><signTechnology>2</signTechnology><signHeightPixels>2</signHeightPixels><signWidthPixels>2</signWidthPixels><signHeight>2</signHeight><signWidth>2</signWidth><charHeightPixels>2</charHeightPixels><charWidthPixels>2</charWidthPixels><dms-beacon-type>2</dms-beacon-type><dms-vertical-border>2</dms-vertical-border><dms-horizontal-border>2</dms-horizontal-border><dms-vertical-pixel-pitch>2</dms-vertical-pixel-pitch><dms-horizontal-pixel-pitch>2</dms-horizontal-pixel-pitch><dms-max-pages>2</dms-max-pages><dms-max-message-length>2</dms-max-message-length><dms-color-scheme>2</dms-color-scheme><dms-multi-tag-support>2</dms-multi-tag-support></dms-inventory-item></mes:dMSInventoryMsg></SOAP-ENV:Body></SOAP-ENV:Envelope>

#PARAMETER TYPE = boolean
#EDITABLE = true
#DOCUMENTATION = Enter (True or False) whether an erroneous transport exchange is expected during this test. 
SubscriptionTransportErrorExpected = false

#PARAMETER TYPE = String
#EDITABLE = true
#DOCUMENTATION = Enter the type of Transport Error (if applicable) that is expected during this test. 
SubscriptionTransportErrorTypeExpected = NONE

#PARAMETER TYPE = boolean
#EDITABLE = true
#DOCUMENTATION = Enter (True or False) whether an erroneous Subscription message is expected during this test. 
SubscriptionMessageErrorExpected = false

#PARAMETER TYPE = boolean
#EDITABLE = true
#DOCUMENTATION = Enter (True or False) whether a Subscription encoding error is expected during this test. 
SubscriptionEncodingErrorExpected = false

#PARAMETER TYPE = String
#EDITABLE = true
#DOCUMENTATION = Enter the Subscription encoding error type that is expected during this test. 
SubscriptionEncodingErrorTypeExpected = NONE

#PARAMETER TYPE = String
#EDITABLE = true
#DOCUMENTATION = Enter the type of Subscription message error (if applicable) is expected during this test. 
SubscriptionMessageErrorTypeExpected = NONE

#PARAMETER TYPE = boolean
#EDITABLE = true
#DOCUMENTATION = Enter (True or False) whether an erroneous transport exchange is expected during the publication dialog of this test. 
PublicationTransportErrorExpected = false

#PARAMETER TYPE = String
#EDITABLE = true
#DOCUMENTATION = Enter the type of Transport Error (if applicable) that is expected during this publication dialog of this test. 
PublicationTransportErrorTypeExpected = NONE

#PARAMETER TYPE = boolean
#EDITABLE = true
#DOCUMENTATION = Enter (True or False) whether an erroneous Publication message request is expected during this test. 
PublicationMessageErrorExpected = false

#PARAMETER TYPE = boolean
#EDITABLE = true
#DOCUMENTATION = Enter (True or False) whether a Publication encoding error is expected during this test. 
PublicationEncodingErrorExpected = false

#PARAMETER TYPE = String
#EDITABLE = true
#DOCUMENTATION = Enter the Publication encoding error type that is expected during this test. 
PublicationEncodingErrorTypeExpected = NONE

#PARAMETER TYPE = String
#EDITABLE = true
#DOCUMENTATION = Enter the type of Publication message error (if applicable) is expected during this test. 
PublicationMessageErrorTypeExpected = NONE

#PARAMETER TYPE = boolean
#EDITABLE = true
#DOCUMENTATION = This variable represents whether the Test Case is expected to pass.
CheckOutcomePassed = true
